In [47]:
import pandas as pd
import os
import numpy as np 
import sqlite3
os.getcwd()

'/Users/kendoka69/python_titanic_project'

In [48]:
os.path.isfile('titanic_data.csv')

True

In [35]:
# create the sqLite DB
db = sqlite3.connect("MyDemo.db")

# Read CSV into dataframe
df1 = pd.read_csv('titanic_data.csv')

# convert the pandas dataframe to a sqlite table
df1.to_sql("passenger_list", db, if_exists="replace")

def run_query(query):
    return pd.read_sql_query(query,db)

os.getcwd()


#add query here
query = '''
SELECT * FROM passenger_list'''
#pd.read_sql_query(query,db)
run_query(query)

,index,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home_dest
0,0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,2,1,0,"Astor, Col. John Jacob",male,47.0000,1,0,PC 17757,227.5250,C62 C64,C,None,124.0,"New York, NY"
3,3,1,1,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0000,1,0,PC 17485,56.9292,A20,C,1,NaN,London / Paris
4,4,3,1,"McCormack, Mr. Thomas Joseph",male,NaN,0,0,367228,7.7500,None,Q,None,NaN,None
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1304,3,0,"Markoff, Mr. Marin",male,35.0000,0,0,349213,7.8958,None,C,None,NaN,None
1305,1305,3,0,"Markun, Mr. Johann",male,33.0000,0,0,349257,7.8958,None,S,None,NaN,None
1306,1306,3,1,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,None,C,C,NaN,None
1307,1307,3,0,"Matinoff, Mr. Nicola",male,NaN,0,0,349255,7.8958,None,C,None,NaN,None
1308,1308,3,1,"McCarthy, Miss. Catherine ""Katie""",female,NaN,0,0,383123,7.7500,None,Q,15 16,NaN,None

In [40]:
query = """
SELECT MIN(age) AS min_age,
       MAX(age) AS max_age
  FROM passenger_list
"""
run_query(query)

   min_age  max_age
0   0.1667     80.0

In [41]:
query = """
SELECT COUNT(*), survived
FROM passenger_list
GROUP BY survived
"""
run_query(query)

   COUNT(*)  survived
0       809         0
1       500         1

In [6]:
len(df1)

1309

In [7]:
df1.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home_dest
0,1,True,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,True,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,False,"Astor, Col. John Jacob",male,47.0000,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
3,1,True,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0000,1,0,PC 17485,56.9292,A20,C,1,NaN,London / Paris
4,3,True,"McCormack, Mr. Thomas Joseph",male,NaN,0,0,367228,7.7500,NaN,Q,NaN,NaN,NaN

In [42]:
df1.count()

pclass       1309
survived     1309
name         1309
sex          1309
age          1046
sibsp        1309
parch        1309
ticket       1309
fare         1308
cabin         295
embarked     1307
boat          486
body          121
home_dest     745
dtype: int64

In [43]:
df1.dtypes

pclass         int64
survived        bool
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home_dest     object
dtype: object

In [17]:
df1.shape

(1309, 14)

In [ ]:
df1.describe()

In [ ]:
df1.Survived.value_counts().head()

In [24]:
df1.isnull().sum()

pclass       0
survived     0
name         0
sex          0
age          0
sibsp        0
parch        0
ticket       0
fare         0
cabin        0
embarked     0
boat         0
body         0
home_dest    0
dtype: int64

In [52]:
df1 = df1.replace("",'no information')
df1

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home_dest
0,1,True,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,True,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,False,"Astor, Col. John Jacob",male,47.0000,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
3,1,True,"Duff Gordon, Sir. Cosmo Edmund (""Mr Morgan"")",male,49.0000,1,0,PC 17485,56.9292,A20,C,1,NaN,London / Paris
4,3,True,"McCormack, Mr. Thomas Joseph",male,NaN,0,0,367228,7.7500,NaN,Q,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,False,"Markoff, Mr. Marin",male,35.0000,0,0,349213,7.8958,NaN,C,NaN,NaN,NaN
1305,3,False,"Markun, Mr. Johann",male,33.0000,0,0,349257,7.8958,NaN,S,NaN,NaN,NaN
1306,3,True,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C,C,NaN,NaN
1307,3,False,"Matinoff, Mr. Nicola",male,NaN,0,0,349255,7.8958,NaN,C,NaN,NaN,NaN
1308,3,True,"McCarthy, Miss. Catherine ""Katie""",female,NaN,0,0,383123,7.7500,NaN,Q,15 16,NaN,NaN